Revit 2027 API
ParameterTypeId.BoundaryRestraintRotX Property
 "X Rotation Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintRotX { get; }
Public Shared ReadOnly Property BoundaryRestraintRotX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintRotX {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintRotX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace